In [6]:
import pandas as pd

In [7]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(url)
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [8]:
del baby_names['Id']
del baby_names['Unnamed: 0']
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [9]:
(baby_names.Gender == 'F').mean()

0.5498315123549408

In [11]:
gb = baby_names.groupby('Gender').agg({
    'Count': 'sum'
})
g

           Count
Gender
F       16380293
M       19041199

In [28]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [12]:
gb / baby_names.Count.sum()

           Count
Gender
F       0.462439
M       0.537561

In [14]:
names = baby_names.groupby('Name')

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1004923  Gryffin  2014      M    WI      5
1004950     Kroy  2014      M    WI      5
1004973     Owyn  2014      M    WI      5
1005707   Haylea  2005      F    WV      5
1012216  Coalton  2012      M    WV      7

[65502 rows x 5 columns]

In [15]:
baby_names.Name.nunique()

17632

In [22]:
name_count = names.Count.sum()
name_count.sort_values(ascending=False)

Name
Jacob         242874
Emma          214852
Michael       214405
Ethan         209277
Isabella      204798
               ...
Eniola             5
Atlantis           5
Marci              5
Simarpreet         5
Nita               5
Name: Count, Length: 17632, dtype: int64

In [23]:
(name_count == 5).sum()

2578

In [33]:
len(baby_names[baby_names.Count == baby_names.Count.min()])

147086

In [29]:
name_count.idxmax()

'Jacob'

In [24]:
name_count.median()

49.0

In [25]:
name_count[name_count == 49]

Name
Aishani    49
Alara      49
Alysse     49
Ameir      49
Anely      49
           ..
Sriram     49
Trinton    49
Vita       49
Yoni       49
Zuleima    49
Name: Count, Length: 66, dtype: int64

In [26]:
name_count.std()

11006.069467891111

In [27]:
name_count.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64